---
title: AnalysisDisplayMarkersAndTextSettings
classe: Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# AnalysisDisplayMarkersAndTextSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `analysisDisplayMarkersAndTextSettings.IsValidObject` | Boolean |
| `Double MarkerSize { get; set; }` | `analysisDisplayMarkersAndTextSettings.MarkerSize` | Double |
| `AnalysisDisplayStyleMarkerType MarkerType { get; set; }` | `analysisDisplayMarkersAndTextSettings.MarkerType` | AnalysisDisplayStyleMarkerType |
| `Double Rounding { get; set; }` | `analysisDisplayMarkersAndTextSettings.Rounding` | Double |
| `AnalysisDisplayStyleMarkerTextLabelType TextLabelType { get; set; }` | `analysisDisplayMarkersAndTextSettings.TextLabelType` | AnalysisDisplayStyleMarkerTextLabelType |
| `ElementId TextTypeId { get; set; }` | `analysisDisplayMarkersAndTextSettings.TextTypeId` | ElementId |
| `Void Dispose()` | `analysisDisplayMarkersAndTextSettings.Dispose()` | Void |
| `Boolean IsEqual(AnalysisDisplayMarkersAndTextSettings)` | `analysisDisplayMarkersAndTextSettings.IsEqual(other)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```